xlloss/ble_uart_bridge/nRF5_SDK_12.3.0_d7731ad/examples/ble_central/ble_app_multilink_central/main.c
static const char m_target_periph_name[] = "Nordic_UART";
#define PACKET_LEN 31
#define PACKET_HEAD 3
#define PACKET_DATA_LEN (PACKET_LEN - PACKET_HEAD)


#define BUFFER_SZ 1024
#define TEST_VERSION "Multilink BLE UART Example v.20\r\n"
#define TX_ORDER_NUM 1024

#define NEW_MAC_ADDRESS_TEST

unsigned char data_buf_cnt[CENTRAL_LINK_COUNT];
int buf_index = 0;
int buf_data_index = 0;
int start_cnt = 0;


struct uart_tx_fifo {
  app_fifo_t tx_fifo_handle;
  uint8_t *tx_buf;      /**< Pointer to the TX buffer. */
  uint32_t tx_buf_size; /**< Size of the RX buffer. */
};

struct tx_packet_order {
  uint8_t fifo_number;
  uint32_t packet_size;
};

struct uart_tx_fifo tx_fifo[CENTRAL_LINK_COUNT];
struct tx_packet_order packet_order;
uint8_t alloc_tx_buf[CENTRAL_LINK_COUNT][BUFFER_SZ] = {0};
static uint32_t packet_data_cnt[CENTRAL_LINK_COUNT] = {0};
uint8_t packet_data_tx_order[TX_ORDER_NUM] = {0};
int tx_order_index_buy = 0;

uint32_t reset_ble_rx_start = 0;
uint32_t reset_ble_rx_stop = 0;
uint32_t reset_ble_cont = 0;

app_fifo_t packet_data_tx_order_hd;

/** @brief Scan parameters requested for scanning and connection. */
static const ble_gap_scan_params_t m_scan_params =
{
    .active   = 0,
    .interval = SCAN_INTERVAL,
    .window   = SCAN_WINDOW,
    .timeout  = SCAN_TIMEOUT,

    #if (NRF_SD_BLE_API_VERSION == 2)
        .selective   = 0,
        .p_whitelist = NULL,
    #endif

    #if (NRF_SD_BLE_API_VERSION == 3)
        .use_whitelist  = 0,
        .adv_dir_report = 0,
    #endif
};

/**@brief Connection parameters requested for connection. */
static const ble_gap_conn_params_t m_connection_param =
{
    (uint16_t)MIN_CONNECTION_INTERVAL,
    (uint16_t)MAX_CONNECTION_INTERVAL,
    (uint16_t)SLAVE_LATENCY,
    (uint16_t)SUPERVISION_TIMEOUT
};

static ble_nus_c_t              m_ble_nus_c[TOTAL_LINK_COUNT];                    /**< Instance of NUS service. Must be passed to all NUS_C API calls. */
static ble_db_discovery_t       m_ble_db_discovery[TOTAL_LINK_COUNT];             /**< Instance of database discovery module. Must be passed to all db_discovert API calls */

#ifdef NEW_MAC_ADDRESS_TEST
//static const ble_gap_addr_t m_target_periph_addr =
//{
//    /* Possible values for addr_type:
//       BLE_GAP_ADDR_TYPE_PUBLIC,
//       BLE_GAP_ADDR_TYPE_RANDOM_STATIC,
//       BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE,
//       BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE. */
//    .addr_type = BLE_GAP_ADDR_TYPE_PUBLIC,
//    .addr      = {0x00, 0x11, 0x22, 0x33, 0x44, 0x55}
//};

struct customer_mac_addr {
  const ble_gap_addr_t m_target_periph_addr;
  uint8_t connected;
};


struct customer_mac_addr cust_mac_addr[CENTRAL_LINK_COUNT] = {
  /* 0 iteam */
  {
    {
      .addr_type = BLE_GAP_ADDR_TYPE_PUBLIC,
      .addr      = {0x00, 0x11, 0x22, 0x33, 0x44, 0x55},
    },
    .connected = 0,
  },
  
  
  /* 1 iteam */
  {
    {
      .addr_type = BLE_GAP_ADDR_TYPE_PUBLIC,
      .addr      = {0x11, 0x11, 0x22, 0x33, 0x44, 0x55},
    },
    .connected = 0,
  },
  
  /* 2 iteam */
  {
    {
      .addr_type = BLE_GAP_ADDR_TYPE_PUBLIC,
      .addr      = {0x22, 0x11, 0x22, 0x33, 0x44, 0x55},     
    },
    .connected = 0,
  },

  /* 3 iteam */
  {
    {
      .addr_type = BLE_GAP_ADDR_TYPE_PUBLIC,
      .addr      = {0x33, 0x11, 0x22, 0x33, 0x44, 0x55},     
    },
    .connected = 0,
  },

  /* 4 iteam */
  {
    {
      .addr_type = BLE_GAP_ADDR_TYPE_PUBLIC,
      .addr      = {0x44, 0x11, 0x22, 0x33, 0x44, 0x55},     
    },
    .connected = 0,
  },

  /* 5 iteam */  
  {
    {
      .addr_type = BLE_GAP_ADDR_TYPE_PUBLIC,
      .addr      = {0x55, 0x11, 0x22, 0x33, 0x44, 0x55},
    },
    .connected = 0,
  },
  
  /* 6 iteam */
  {
    {
      .addr_type = BLE_GAP_ADDR_TYPE_PUBLIC,
      .addr      = {0x66, 0x11, 0x22, 0x33, 0x44, 0x55},     
    },
    .connected = 0,
  },
  
};

//static const ble_gap_addr_t m_target_periph_addr[CENTRAL_LINK_COUNT] =
//{
//  /* 0 iteam */
//  {
//    .addr_type = BLE_GAP_ADDR_TYPE_PUBLIC,
//    .addr      = {0x00, 0x11, 0x22, 0x33, 0x44, 0x55}
//  }
//  
//  /* 1 iteam */
//  {
//    .addr_type = BLE_GAP_ADDR_TYPE_PUBLIC,
//    .addr      = {0x11, 0x11, 0x22, 0x33, 0x44, 0x55}
//  }
//
//  /* 2 iteam */
//  {
//    .addr_type = BLE_GAP_ADDR_TYPE_PUBLIC,
//    .addr      = {0x22, 0x11, 0x22, 0x33, 0x44, 0x55}
//  }
//
//  /* 3 iteam */
//  {
//    .addr_type = BLE_GAP_ADDR_TYPE_PUBLIC,
//    .addr      = {0x33, 0x11, 0x22, 0x33, 0x44, 0x55}
//  }
//
//  /* 4 iteam */
//  {
//    .addr_type = BLE_GAP_ADDR_TYPE_PUBLIC,
//    .addr      = {0x44, 0x11, 0x22, 0x33, 0x44, 0x55}
//  }
//
//  /* 5 iteam */
//  {
//    .addr_type = BLE_GAP_ADDR_TYPE_PUBLIC,
//    .addr      = {0x55, 0x11, 0x22, 0x33, 0x44, 0x55}
//  }
//
//  /* 6 iteam */
//  {
//    .addr_type = BLE_GAP_ADDR_TYPE_PUBLIC,
//    .addr      = {0x66, 0x11, 0x22, 0x33, 0x44, 0x55}
//  }
//  
//};
#endif

/**@brief Function to handle asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num     Line number of the failing ASSERT call.
 * @param[in] p_file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(0xDEADBEEF, line_num, p_file_name);
}

#ifndef NEW_MAC_ADDRESS_TEST
/**
 * @brief Parses advertisement data, providing length and location of the field in case
 *        matching data is found.
 *
 * @param[in]  type       Type of data to be looked for in advertisement data.
 * @param[in]  p_advdata  Advertisement report length and pointer to report.
 * @param[out] p_typedata If data type requested is found in the data report, type data length and
 *                        pointer to data will be populated here.
 *
 * @retval NRF_SUCCESS if the data type is found in the report.
 * @retval NRF_ERROR_NOT_FOUND if the data type could not be found.
 */

