xlloss/ble_uart_bridge/nRF5_SDK_12.3.0_d7731ad/examples/ble_central/ble_app_multilink_central/main.c
static uint32_t adv_report_parse(uint8_t type, uint8_array_t * p_advdata, uint8_array_t * p_typedata)
{
    uint32_t  index = 0;
    uint8_t * p_data;

    p_data = p_advdata->p_data;

    while (index < p_advdata->size)
    {
        uint8_t field_length = p_data[index];
        uint8_t field_type   = p_data[index + 1];

        if (field_type == type)
        {
            p_typedata->p_data = &p_data[index + 2];
            p_typedata->size   = field_length - 1;
            return NRF_SUCCESS;
        }
        index += field_length + 1;
    }
    return NRF_ERROR_NOT_FOUND;
}

#endif

/**@brief Function to start scanning.
 */
static void scan_start(void)
{
    ret_code_t ret;

    (void) sd_ble_gap_scan_stop();

    NRF_LOG_INFO("Start scanning for device name %s.\r\n", (uint32_t)m_target_periph_name);
    ret = sd_ble_gap_scan_start(&m_scan_params);
    APP_ERROR_CHECK(ret);
}


/**@brief Callback handling NUS Client events.
 *
 * @details This function is called to notify the application of NUS client events.
 *
 * @param[in]   p_ble_nus_c   NUS Client Handle. This identifies the NUS client
 * @param[in]   p_ble_nus_evt Pointer to the NUS Client event.
 */

//#define DEBUG

/**@snippet [Handling events from the ble_nus_c module] */
static void ble_nus_c_evt_handler(ble_nus_c_t * p_ble_nus_c, const ble_nus_c_evt_t * p_ble_nus_evt)
{
    uint32_t err_code;
    static uint8_t packet_head[CENTRAL_LINK_COUNT][3], ble_hd;
    static uint8_t packet_end[CENTRAL_LINK_COUNT][3];

    switch (p_ble_nus_evt->evt_type)
    {
        case BLE_NUS_C_EVT_DISCOVERY_COMPLETE:
            err_code = ble_nus_c_handles_assign(p_ble_nus_c, p_ble_nus_evt->conn_handle, &p_ble_nus_evt->handles);
            APP_ERROR_CHECK(err_code);

            err_code = ble_nus_c_rx_notif_enable(p_ble_nus_c);
            APP_ERROR_CHECK(err_code);
            NRF_LOG_INFO("The device has the Nordic UART Service\r\n");
            break;

        case BLE_NUS_C_EVT_NUS_RX_EVT:
            ble_hd = p_ble_nus_c->conn_handle;
            for (uint32_t i = 0; i < p_ble_nus_evt->data_len; i++) {
              err_code = app_fifo_put(&tx_fifo[ble_hd].tx_fifo_handle, p_ble_nus_evt->p_data[i]);
              if (err_code != NRF_SUCCESS) {
                NRF_LOG_INFO ("tx_fifo[%d].tx_fifo_handle app_fifo_put fail: ble_hd %d\r\n", ble_hd, ble_hd);
              }
            }

            packet_data_cnt[ble_hd] = packet_data_cnt[ble_hd] + 1;

            err_code = app_fifo_put(&packet_data_tx_order_hd, ble_hd);
            if (err_code != NRF_SUCCESS) {
              NRF_LOG_INFO ("packet_data_tx_order_hd app_fifo_put fail: ble_hd %d\r\n", ble_hd);
            }
            NRF_LOG_INFO ("ble_hd %d\r\n", ble_hd);
//#ifdef DEBUG
//            NRF_LOG_INFO("BLE_NUS_C_EVT_NUS_RX_EVT %d\r\n", p_ble_nus_c->conn_handle);
//            NRF_LOG_INFO("DBG : data_len %d\r\n", p_ble_nus_evt->data_len);
//            for (uint32_t i = 0; i < p_ble_nus_evt->data_len; i++)
//              NRF_LOG_INFO("%c\r\n", p_ble_nus_evt->p_data[i]);
//
//            NRF_LOG_INFO("\r\n");
//#endif
//            //packet_order
//            for (uint32_t i = 0; i < p_ble_nus_evt->data_len; i++) {
//              if (i + 2 < p_ble_nus_evt->data_len && packet_data_cnt[ble_hd] == 0) {
//                packet_head[ble_hd][0] = p_ble_nus_evt->p_data[i + 0];
//                packet_head[ble_hd][1] = p_ble_nus_evt->p_data[i + 1];
//                packet_head[ble_hd][2] = p_ble_nus_evt->p_data[i + 2];
//              }
//
//              if (packet_head[ble_hd][0] == '$' && packet_head[ble_hd][1] == '$' && packet_head[ble_hd][2] == '$' && packet_data_cnt[ble_hd] == 0) {
//                    err_code = app_fifo_put(&tx_fifo[ble_hd].tx_fifo_handle, packet_head[ble_hd][0]);
//                    err_code = app_fifo_put(&tx_fifo[ble_hd].tx_fifo_handle, packet_head[ble_hd][1]);
//                    err_code = app_fifo_put(&tx_fifo[ble_hd].tx_fifo_handle, packet_head[ble_hd][2]);
//                    if (err_code != NRF_SUCCESS) {
//                      app_fifo_flush(&tx_fifo[ble_hd].tx_fifo_handle);
//                      NRF_LOG_INFO("app_fifo_put fail ble_hd %d\r\n", ble_hd);
//                      packet_data_cnt[ble_hd] = 0;
//                      packet_head[ble_hd][0] = 0;
//                      packet_head[ble_hd][1] = 0;
//                      packet_head[ble_hd][2] = 0;
//                      goto err_exit;
//                    }
//                    packet_data_cnt[ble_hd] = 3;
//                    i = i + 2;
//                    continue;
//              } else if (packet_data_cnt[ble_hd] >= 3) {
//                    err_code = app_fifo_put(&tx_fifo[ble_hd].tx_fifo_handle, p_ble_nus_evt->p_data[i]);
//                    if (err_code != NRF_SUCCESS) {
//                      app_fifo_flush(&tx_fifo[ble_hd].tx_fifo_handle);
//                      NRF_LOG_INFO("app_fifo_put fail ble_hd %d\r\n", ble_hd);
//                      packet_data_cnt[ble_hd] = 0;
//                      packet_head[ble_hd][0] = 0;
//                      packet_head[ble_hd][1] = 0;
//                      packet_head[ble_hd][2] = 0;
//                      goto err_exit;
//                    }
//                    
//                    packet_data_cnt[ble_hd] = packet_data_cnt[ble_hd] + 1;
//              }
//
//              if (i + 2 < p_ble_nus_evt->data_len && packet_data_cnt[ble_hd] > 3) {
//                packet_end[ble_hd][0] = p_ble_nus_evt->p_data[i + 0];
//                packet_end[ble_hd][1] = p_ble_nus_evt->p_data[i + 1];
//                packet_end[ble_hd][2] = p_ble_nus_evt->p_data[i + 2];
//                
//                if (packet_end[ble_hd][0] == '#' && packet_end[ble_hd][1] == '#' && packet_end[ble_hd][2] == '#') {
//                  
//                    err_code = app_fifo_put(&tx_fifo[ble_hd].tx_fifo_handle, '#');
//                    if (err_code != NRF_SUCCESS) {
//                      NRF_LOG_INFO("app_fifo_put fail ble_hd %d\r\n", ble_hd);
//                      app_fifo_flush(&tx_fifo[ble_hd].tx_fifo_handle);
//                      packet_data_cnt[ble_hd] = 0;
//                      packet_head[ble_hd][0] = 0;
//                      packet_head[ble_hd][1] = 0;
//                      packet_head[ble_hd][2] = 0;
//                      goto err_exit;
//                    }
//
//                    err_code = app_fifo_put(&tx_fifo[ble_hd].tx_fifo_handle, '#');
//                    if (err_code != NRF_SUCCESS) {
//                      NRF_LOG_INFO("app_fifo_put fail ble_hd %d\r\n", ble_hd);
//                      app_fifo_flush(&tx_fifo[ble_hd].tx_fifo_handle);
//                      packet_data_cnt[ble_hd] = 0;
//                      packet_head[ble_hd][0] = 0;
//                      packet_head[ble_hd][1] = 0;
//                      packet_head[ble_hd][2] = 0;
//                      goto err_exit;
//                    }
//
//                    packet_data_cnt[ble_hd] = packet_data_cnt[ble_hd] + 2;
//
//                    NRF_LOG_INFO("!!! ble_hd %d!!!\r\n",  ble_hd);                    
//
//                    err_code = app_fifo_put(&packet_data_tx_order_hd, ble_hd);
//                    if (err_code != NRF_SUCCESS) {
//                      NRF_LOG_INFO ("packet_data_tx_order_hd FIFO put FAIL\r\n");
//                      app_fifo_flush(&tx_fifo[ble_hd].tx_fifo_handle);
//                      packet_data_cnt[ble_hd] = 0;
//                      packet_head[ble_hd][0] = 0;
//                      packet_head[ble_hd][1] = 0;
//                      packet_head[ble_hd][2] = 0;
//                      goto err_exit;
//                    }
//
//                    err_code = app_fifo_put(&packet_data_tx_order_hd, ble_hd);
//                    if (err_code != NRF_SUCCESS) {
//                      NRF_LOG_INFO ("packet_data_tx_order_hd FIFO put FAIL\r\n");
//                      app_fifo_flush(&tx_fifo[ble_hd].tx_fifo_handle);
//                      packet_data_cnt[ble_hd] = 0;
//                      packet_head[ble_hd][0] = 0;
//                      packet_head[ble_hd][1] = 0;
//                      packet_head[ble_hd][2] = 0;
//                      goto err_exit;
//                    }
//
//                    err_code = app_fifo_put(&packet_data_tx_order_hd, ble_hd);
//                    if (err_code != NRF_SUCCESS) {
//                      NRF_LOG_INFO ("packet_data_tx_order_hd FIFO put FAIL\r\n");
//                      app_fifo_flush(&tx_fifo[ble_hd].tx_fifo_handle);
//                      packet_data_cnt[ble_hd] = 0;
//                      packet_head[ble_hd][0] = 0;
//                      packet_head[ble_hd][1] = 0;
//                      packet_head[ble_hd][2] = 0;
//                      goto err_exit;
//                    }
//
//                    packet_data_cnt[ble_hd] = 0;
//                    packet_head[ble_hd][0] = 0;
//                    packet_head[ble_hd][1] = 0;
//                    packet_head[ble_hd][2] = 0;
//
//                    if (tx_order_index_buy >= TX_ORDER_NUM) {
//                      tx_order_index_buy = 0;
//                    }
//                    
//                    i = i + 2;
//                    continue;
//                }
//              }
//            }
//err_exit:
            break;

        case BLE_NUS_C_EVT_DISCONNECTED:
            NRF_LOG_INFO("Disconnected\r\n");
            scan_start();
            break;
    }
}


